spec/support/fixtures/get_sucursales.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:and="http://www.andreani.com.ar">
   <soap:Header>
    <wsse:Security soap:mustUnderstand="true" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
     <wsse:UsernameToken>

      <wsse:Username>eCommerce_Integra</wsse:Username>
      <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">passw0rd</wsse:Password>
     </wsse:UsernameToken>
    </wsse:Security>
   </soap:Header>
   <soap:Body>
      <and:ConsultarSucursales>
         <and:consulta>
            <and:CodigoPostal xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <and:Localidad xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <and:Provincia>CHUBUT</and:Provincia>
         </and:consulta>
      </and:ConsultarSucursales>
   </soap:Body>
</soap:Envelope>
